---------------------------------------------------------------------->
-- 脚本名称:	scripts/skill/npc/副本BOSS/25人天王殿/玩家道具_少林变装_禁止上马.lua
-- 更新时间:	2013/9/16 18:14:50
-- 更新用户:	liying-2
-- 脚本说明:	
----------------------------------------------------------------------<
------------------------------------------------
-- 文件名    :  玩家道具_少林变装_禁止上马.lua
-- 创建人    :  
-- 创建时间  : 
-- 用途(模块):  
-- 武功门派  :  无
-- 武功类型  :  无
-- 武功套路  :  无
-- 技能名称  :  无
-- 技能效果  :  
------------------------------------------------

--------------脚本文件开始------------------------------------------------
function OnRemove(nCharacterID, BuffID, nBuffLevel, nLeftFrame)
	local player = GetPlayer(nCharacterID)
	if player then
		local buff = player.GetBuff(2587, 1)
		if buff then
			player.DelBuff(2587, 1)
		end
	end
end
 -- by 每天涨停@梦江南 $ Jx3UnPack-PAKV3 jx3.mail@gmail.com