---------------------------------------------------------------------->
-- 脚本名称:	scripts/Traffic/SeaTrafficCost.lua
-- 更新时间:	2015/6/30 10:52:15
-- 更新用户:	zhangtianhui1
-- 脚本说明:
----------------------------------------------------------------------<
----------------------------------------------
-- 脚本文件：船费.lua
----------------------------------------------
-- 坐船计费脚本,绑在出发路点上的，改变返回金钱的函数

function CalcCost(dwplayerID, Route_Node, nTargetCity, nCostMoney)
	--return 8--800       --这个起点无论到哪都只需要8银
	return 0
end;

 -- by 每天涨停@梦江南 $ Jx3UnPack-PAKV3 jx3.mail@gmail.com