---------------------------------------------------------------------->
-- 脚本名称:	scripts/Traffic/免车费.lua
-- 更新时间:	2015/6/30 9:51:18
-- 更新用户:	zhangyan3
-- 脚本说明:
----------------------------------------------------------------------<
----------------------------------------------
-- 脚本文件：0车费.lua
----------------------------------------------
-- 交通计费脚本,绑在出发路点上的，改变返回金钱的函数

function CalcCost(dwplayerID, Route_Node, nTargetCity, nCostMoney)
	return 0
end;

 -- by 每天涨停@梦江南 $ Jx3UnPack-PAKV3 jx3.mail@gmail.com